<script setup lang="ts"></script>

<template>
  <h1 class="page__title">تماس با ما</h1>

  <div class="max-w-2xl bg-secondary rounded-md shadow-lg mx-auto py-5 px-5">
    <h3 class="font-bold text-2xl">ارسال نظر، پیشنهاد و انتقاد</h3>
    <div class="flex flex-col gap-5 mt-5">
      <input
        type="text"
        placeholder="نام و نام خانوادگی"
        class="py-3 text-lg leading-10 duration-150 focus:ring-2 ring-blue px-4 rounded-md bg-white w-full"
      />
      <input
        type="text"
        placeholder="ایمیل / شماره تلفن"
        class="py-3 text-lg leading-10 duration-150 focus:ring-2 ring-blue px-4 rounded-md bg-white w-full"
      />
      <textarea
        placeholder="ایمیل / شماره تلفن"
        class="resize-none h-64 py-3 text-lg leading-10 duration-150 focus:ring-2 ring-blue px-4 rounded-md bg-white w-full"
      />
      <button
        class="rounded-md bg-blue text-white w-full leading-8 text-lg py-3 px-6"
      >
        ثبت نظر
      </button>
    </div>
  </div>

  <div class="mt-20">
    <h3 class="font-bold text-2xl">ارسال نظر، پیشنهاد و انتقاد</h3>
    <div class="flex flex-col gap-4 mt-6">
      <div class="flex items-center gap-4">
        <svg
          xmlns="http://www.w3.org/2000/svg"
          width="40"
          height="40"
          viewBox="0 0 41.697 41.697"
        >
          <g id="Layer_2" data-name="Layer 2" transform="translate(0.01)">
            <g id="OBJECTS" transform="translate(-0.01 0)">
              <path
                id="Path_300"
                data-name="Path 300"
                d="M40.025,12.818a20.743,20.743,0,1,0,1.662,8.112A20.5,20.5,0,0,0,40.025,12.818Z"
                transform="translate(0.01 0)"
                fill="#869bdb"
              />
              <path
                id="Path_301"
                data-name="Path 301"
                d="M21.985,7.108a10.153,10.153,0,0,0-8.627,15.474l8.058,12.972a.849.849,0,0,0,.714.4h0a.822.822,0,0,0,.714-.407l7.85-13.1A10.144,10.144,0,0,0,21.976,7.09Zm7.226,14.453L22.121,33.485,14.8,21.688a8.464,8.464,0,1,1,14.453-.108Z"
                transform="translate(-1.137 -0.686)"
                fill="#fff"
              />
              <path
                id="Path_302"
                data-name="Path 302"
                d="M22.527,12.72A5.077,5.077,0,1,0,27.6,17.788a5.077,5.077,0,0,0-5.077-5.068Zm0,8.464a3.4,3.4,0,1,1,3.387-3.4,3.4,3.4,0,0,1-3.387,3.4Z"
                transform="translate(-1.678 -1.23)"
                fill="#fff"
              />
            </g>
          </g>
        </svg>
        <span class="text-base text-gray-500"
          ><span class="font-bold text-xl text-black">آدرس: </span> کلی طرح
          سفارش گرفته شده استفاده می نماید، تا از نظر گرافیکی نشانگر چگونگی نوع
          و اندازه فونت و ظاهر متن باشد.</span
        >
      </div>
      <div class="flex items-center gap-4">
        <svg
          xmlns="http://www.w3.org/2000/svg"
          width="40"
          height="40"
          viewBox="0 0 46.89 46.89"
        >
          <g id="Layer_2" data-name="Layer 2" transform="translate(0.01)">
            <g id="OBJECTS" transform="translate(-0.01 0)">
              <path
                id="Path_295"
                data-name="Path 295"
                d="M45.011,14.414a23.327,23.327,0,1,0,1.869,9.112,23.039,23.039,0,0,0-1.869-9.112Z"
                transform="translate(0.01 0)"
                fill="#869bdb"
              />
              <path
                id="Path_296"
                data-name="Path 296"
                d="M30.167,33.18H28.136a1.016,1.016,0,1,0,0,2.032h2.032a1.016,1.016,0,1,0,0-2.032Z"
                transform="translate(0.439 0.525)"
                fill="#fff"
              />
              <path
                id="Path_297"
                data-name="Path 297"
                d="M24.769,7.093a7.111,7.111,0,0,0-8.614,7.019v4.063a7.111,7.111,0,0,0,2.032,4.988v2.509l-3.626.9A5.079,5.079,0,0,0,10.8,32.518l1.27,6.389a1.016,1.016,0,0,0,1.016.823H33.454a1.016,1.016,0,0,0,1.016-.823l1.27-6.389a5.079,5.079,0,0,0-3.769-5.942l-3.7-.914V23.254a7.111,7.111,0,0,0,2.174-5.079V14.112a7.111,7.111,0,0,0-.142-1.514A6.816,6.816,0,0,0,24.769,7.093Zm2.225,20.316.335.081a5.079,5.079,0,0,1-8.126,0l.234-.051a1.016,1.016,0,0,0,.772-1.016V24.615a7.111,7.111,0,0,0,3.047.691,7.029,7.029,0,0,0,2.986-.63v1.778a1.016,1.016,0,0,0,.752,1Zm1.4-9.234a5.079,5.079,0,0,1-10.158,0V15.128h5.079A7.172,7.172,0,0,0,28.274,13.1a4.956,4.956,0,0,1,.112,1.016ZM23.316,9.033a5.079,5.079,0,0,1,4.063,2.032A5.079,5.079,0,0,1,23.316,13.1H18.288a5.079,5.079,0,0,1,5-4.063ZM33.728,32.112l-1.107,5.567H13.92l-1.107-5.567a3.047,3.047,0,0,1,2.255-3.565l2.032-.518a7.111,7.111,0,0,0,12.3,0l2.032.5A3.047,3.047,0,0,1,33.728,32.112Z"
                transform="translate(0.179 0.11)"
                fill="#fff"
              />
            </g>
          </g>
        </svg>

        <span class="text-base text-gray-500"
          ><span class="font-bold text-xl text-black">تلفن پشتیبانی : </span>
          4038 51 44 021</span
        >
      </div>
      <div class="flex items-center gap-4">
        <svg
          xmlns="http://www.w3.org/2000/svg"
          width="40"
          height="40"
          viewBox="0 0 60 60"
        >
          <g id="Layer_2" data-name="Layer 2" transform="translate(0.01)">
            <g id="OBJECTS" transform="translate(-0.01 0)">
              <path
                id="Path_309"
                data-name="Path 309"
                d="M57.6,18.445A29.849,29.849,0,1,0,59.99,30.1,29.48,29.48,0,0,0,57.6,18.445Z"
                transform="translate(0.01 0)"
                fill="#869bdb"
              />
              <path
                id="Path_310"
                data-name="Path 310"
                d="M20.736,26.176a7.8,7.8,0,0,0,7.578.416,1.079,1.079,0,0,0,.533-1.443,1.092,1.092,0,0,0-1.443-.533,5.654,5.654,0,0,1-5.5-.273,5.446,5.446,0,1,1,8.384-4.575,1.092,1.092,0,1,1-2.184,0h0a3.276,3.276,0,1,0-3.276,3.263,3.224,3.224,0,0,0,2.184-.832,3.263,3.263,0,0,0,5.446-2.431,7.63,7.63,0,1,0-11.7,6.421Zm4.094-5.329a1.092,1.092,0,0,1,0-2.184,1.1,1.1,0,0,1,1.092.962.78.78,0,0,0,0,.3A1.092,1.092,0,0,1,24.83,20.847Z"
                transform="translate(5.17 3.629)"
                fill="#fff"
              />
              <path
                id="Path_311"
                data-name="Path 311"
                d="M43.188,23.081a1.066,1.066,0,0,0-.325-.767l-4.029-4.042V9.862A1.092,1.092,0,0,0,37.741,8.77h-21.8a1.092,1.092,0,0,0-1.092,1.092v8.41l-4.029,4.042h0a1.118,1.118,0,0,0-.312.767h0V42.7a3.276,3.276,0,0,0,3.237,3.263H39.912A3.276,3.276,0,0,0,43.188,42.7Zm-2.6,0L38.833,24.81V21.352Zm-3.9-12.127v7.8h0v8.254l-5.9,5.9h-7.8l-5.9-5.9v-8.28h0v-7.8ZM14.851,24.81l-1.729-1.729,1.729-1.729ZM12.681,42.241V25.707l8.267,8.267Zm1.534,1.534,8.722-8.709h7.8l8.722,8.709Zm26.828-1.534-8.267-8.267,8.267-8.267Z"
                transform="translate(3.164 2.63)"
                fill="#fff"
              />
            </g>
          </g>
        </svg>
        <span class="text-base text-gray-500"
          ><span class="font-bold text-xl text-black">ایمیل : </span>
          soheil.ghanbary@gmail.com</span
        >
      </div>
      <div class="flex items-center gap-4">
        <svg
          xmlns="http://www.w3.org/2000/svg"
          width="40"
          height="40"
          viewBox="0 0 60 60"
        >
          <g id="Layer_2" data-name="Layer 2" transform="translate(0.01)">
            <g id="OBJECTS" transform="translate(-0.01 0)">
              <path
                id="Path_298"
                data-name="Path 298"
                d="M57.6,18.445A29.849,29.849,0,1,0,59.99,30.1,29.48,29.48,0,0,0,57.6,18.445Z"
                transform="translate(0.01 0)"
                fill="#869bdb"
              />
              <path
                id="Path_299"
                data-name="Path 299"
                d="M45.331,36.431l-4.692-4.705a3.341,3.341,0,0,0-4.692,0l-2.119,2.106a2.6,2.6,0,0,1-3.562,0l-9.242-9.255a2.509,2.509,0,0,1,0-3.562l2.132-2.132a3.328,3.328,0,0,0,0-4.692L18.451,9.525a3.315,3.315,0,0,0-4.692,0l-1.716,1.69a12,12,0,0,0,0,16.9L26.7,42.8a11.958,11.958,0,0,0,16.9,0l1.7-1.7A3.315,3.315,0,0,0,45.331,36.431Zm-6.3-3.159,4.692,4.692a1.1,1.1,0,0,1,0,1.56l-.78.78-6.265-6.252.78-.78A1.118,1.118,0,0,1,39.027,33.272ZM16.93,11.084l4.692,4.679a1.118,1.118,0,0,1,0,1.573l-.793.78-6.291-6.252.78-.78a1.118,1.118,0,0,1,1.612,0ZM28.3,41.24,13.615,26.578A9.723,9.723,0,0,1,13.03,13.45l6.239,6.239a4.731,4.731,0,0,0,.195,6.5l9.255,9.255h0a4.731,4.731,0,0,0,6.5.208l6.239,6.239a9.723,9.723,0,0,1-13.193-.65Z"
                transform="translate(2.58 2.564)"
                fill="#fff"
              />
            </g>
          </g>
        </svg>

        <span class="text-base text-gray-500"
          ><span class="font-bold text-xl text-black">تلفن ثابت : </span> 6630
          705 0912</span
        >
      </div>
    </div>
  </div>

  <div class="max-w-sm mx-auto mt-10">
    <h2 class="text-xl mb-5 font-bold text-center text-black">
      ما را در شبکه های اجتماعی دنبال کنید
    </h2>
    <div class="grid grid-cols-4 gap-5">
      <div class="social__icon">
        <svg
          xmlns="http://www.w3.org/2000/svg"
          width="100%"
          height="100%"
          viewBox="0 0 24 24"
          fill="#3bf"
        >
          <path
            d="M24 4.557c-.883.392-1.832.656-2.828.775 1.017-.609 1.798-1.574 2.165-2.724-.951.564-2.005.974-3.127 1.195-.897-.957-2.178-1.555-3.594-1.555-3.179 0-5.515 2.966-4.797 6.045-4.091-.205-7.719-2.165-10.148-5.144-1.29 2.213-.669 5.108 1.523 6.574-.806-.026-1.566-.247-2.229-.616-.054 2.281 1.581 4.415 3.949 4.89-.693.188-1.452.232-2.224.084.626 1.956 2.444 3.379 4.6 3.419-2.07 1.623-4.678 2.348-7.29 2.04 2.179 1.397 4.768 2.212 7.548 2.212 9.142 0 14.307-7.721 13.995-14.646.962-.695 1.797-1.562 2.457-2.549z"
          />
        </svg>
      </div>

      <div class="social__icon">
        <svg
          xmlns="http://www.w3.org/2000/svg"
          width="100%"
          height="100%"
          fill="#37c"
          viewBox="0 0 24 24"
        >
          <path
            d="M22.675 0h-21.35c-.732 0-1.325.593-1.325 1.325v21.351c0 .731.593 1.324 1.325 1.324h11.495v-9.294h-3.128v-3.622h3.128v-2.671c0-3.1 1.893-4.788 4.659-4.788 1.325 0 2.463.099 2.795.143v3.24l-1.918.001c-1.504 0-1.795.715-1.795 1.763v2.313h3.587l-.467 3.622h-3.12v9.293h6.116c.73 0 1.323-.593 1.323-1.325v-21.35c0-.732-.593-1.325-1.325-1.325z"
          />
        </svg>
      </div>

      <div class="social__icon">
        <svg
          xmlns="http://www.w3.org/2000/svg"
          width="100%"
          height="100%"
          fill="#a24"
          viewBox="0 0 24 24"
        >
          <path
            d="M12 2.163c3.204 0 3.584.012 4.85.07 3.252.148 4.771 1.691 4.919 4.919.058 1.265.069 1.645.069 4.849 0 3.205-.012 3.584-.069 4.849-.149 3.225-1.664 4.771-4.919 4.919-1.266.058-1.644.07-4.85.07-3.204 0-3.584-.012-4.849-.07-3.26-.149-4.771-1.699-4.919-4.92-.058-1.265-.07-1.644-.07-4.849 0-3.204.013-3.583.07-4.849.149-3.227 1.664-4.771 4.919-4.919 1.266-.057 1.645-.069 4.849-.069zm0-2.163c-3.259 0-3.667.014-4.947.072-4.358.2-6.78 2.618-6.98 6.98-.059 1.281-.073 1.689-.073 4.948 0 3.259.014 3.668.072 4.948.2 4.358 2.618 6.78 6.98 6.98 1.281.058 1.689.072 4.948.072 3.259 0 3.668-.014 4.948-.072 4.354-.2 6.782-2.618 6.979-6.98.059-1.28.073-1.689.073-4.948 0-3.259-.014-3.667-.072-4.947-.196-4.354-2.617-6.78-6.979-6.98-1.281-.059-1.69-.073-4.949-.073zm0 5.838c-3.403 0-6.162 2.759-6.162 6.162s2.759 6.163 6.162 6.163 6.162-2.759 6.162-6.163c0-3.403-2.759-6.162-6.162-6.162zm0 10.162c-2.209 0-4-1.79-4-4 0-2.209 1.791-4 4-4s4 1.791 4 4c0 2.21-1.791 4-4 4zm6.406-11.845c-.796 0-1.441.645-1.441 1.44s.645 1.44 1.441 1.44c.795 0 1.439-.645 1.439-1.44s-.644-1.44-1.439-1.44z"
          />
        </svg>
      </div>

      <div class="social__icon">
        <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 240 240">
          <defs>
            <linearGradient id="a" x1=".667" x2=".417" y1=".167" y2=".75">
              <stop offset="0" stop-color="#37aee2" />
              <stop offset="1" stop-color="#1e96c8" />
            </linearGradient>
            <linearGradient id="b" x1=".66" x2=".851" y1=".437" y2=".802">
              <stop offset="0" stop-color="#eff7fc" />
              <stop offset="1" stop-color="#fff" />
            </linearGradient>
          </defs>
          <circle cx="120" cy="120" r="120" fill="url(#a)" />
          <path
            fill="#c8daea"
            d="M98 175c-3.888 0-3.227-1.468-4.568-5.17L82 132.207 170 80"
          />
          <path
            fill="#a9c9dd"
            d="M98 175c3 0 4.325-1.372 6-3l16-15.558-19.958-12.035"
          />
          <path
            fill="url(#b)"
            d="M100.04 144.41l48.36 35.729c5.519 3.045 9.501 1.468 10.876-5.123l19.685-92.763c2.015-8.08-3.08-11.746-8.36-9.349l-115.59 44.571c-7.89 3.165-7.843 7.567-1.438 9.528l29.663 9.259 68.673-43.325c3.242-1.966 6.218-.91 3.776 1.258"
          />
        </svg>
      </div>
    </div>
  </div>
</template>
<style scoped>
.social__icon {
  @apply duration-150 hover:scale-90 rounded-full p-4  flex justify-center items-center cursor-pointer;
}
</style>
